#include<iostream>
using namespace std;
//2025年1月18日 13:27:23
int main() {
	//int 每个元素占四个字节，十个元素占四十个字节
	int arr[10] = { 1,5,9,3,4,7,8,5,6,2 };
	//sizeof（数组名称）可以显示该数组所占用内存的大小
	cout << "数组所占总共的内存大小：\t" << sizeof(arr) <<"字节" << endl;
	cout << "每个元素所占的内存大小：\t" << sizeof(arr) / 10 << "字节" << endl;
	cout << "第一个元素所占内存大小：\t" << sizeof(arr[0]) << "字节" << endl;
	cout << "数组中元素的总个数：    \t" << sizeof(arr) / sizeof(arr[0]) << endl;
	cout << "数组首地址为：          \t" << arr <<"(十六进制)\t"<<(int)arr<<"(十进制)\t" << endl;
	//获取一个元素的地址要用取地址符 &
	cout << "数组的第一个元素的地址为：\t" << &arr[0] << "(十六进制)\t" << (int)&arr[0] << "(十进制)\t" << endl;
	//数组的首地址就是数组中第一个元素的地址
	cout << "数组最后一个元素的地址为：\t" << &arr[10] << "(十六进制)\t" << (int)&arr[10] << "(十进制)\t" << endl;

	//数组是存储在连续的一段内存中的
	cout << endl;
	cout << "数组在内存中的示意图" << endl;
	cout << "-------------------------------------------" << "-------------------------------------------\t"<<endl;
	cout << "-             -           -               -" << "-             -           -               -\t" <<endl;
	cout << "-             -           -               -" << "-             -           -               -\t" << endl;
	cout << "-      1      -     2     -       3       -" << "-       4     -     5     -      6        -\t" << endl;
	cout << "-             -           -               -" << "-             -           -               -\t" << endl;
	cout << "-------------------------------------------" << "-------------------------------------------\t" << endl;

	//arr++;(这会报错，显示“表达式必须为可修改的左值”说明数组是常量，不能修改 )


	system("pause");
	return 0;
}
/*界面——————————————
数组所占总共的内存大小：        40字节
每个元素所占的内存大小：        4字节
第一个元素所占内存大小：        4字节
数组中元素的总个数：            10
数组首地址为：                  00000045E53CFC78(十六进制) - 448988040(十进制)
数组的第一个元素的地址为：      00000045E53CFC78(十六进制) - 448988040(十进制)
数组最后一个元素的地址为：      00000045E53CFCA0(十六进制) - 448988000(十进制)

数组在内存中的示意图
--------------------------------------------------------------------------------------
- ---- - --
- ---- - --
- 1 - 2 - 3       --       4 - 5 - 6 -
----- - --
--------------------------------------------------------------------------------------
请按任意键继续. . .
功能——————————————
？
总结——————————————
1.int 每个元素占四个字节，十个元素占四十个字节
2.获取一个元素的地址要用取地址符 &
*/