#include<iostream>
using namespace std;
//2025年1月21日 11:48:02
int main() {
	int arr[5] = { 8,6,7,2,1 };
	int* p = arr;
	cout << "使用指针遍历数组"<<endl;
	for (int i = 0;i < 5;i++) {
		cout << *p <<"\t" <<(int)p<< endl;
		p++;
	}
	cout << "遍历数组" << endl;
	for (int i = 0;i < 5;i++) {
		cout << arr[i] << "\t" << (int)&arr[i] << endl;
	}

	system("pause");
	return 0;
}
/*
界面——————————————
使用指针遍历数组
8       1041692680
6       1041692684
7       1041692688
2       1041692692
1       1041692696
遍历数组
8       1041692680
6       1041692684
7       1041692688
2       1041692692
1       1041692696
请按任意键继续. . .
功能——————————————
使用指针遍历数组
总结——————————————

*/